class Url:
    BASE_URL = "https://qa-scooter.praktikum-services.ru/"
    ORDER_URL = BASE_URL + "order"


class Answers:
    TEST_ANSWER_1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    TEST_ANSWER_2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    TEST_ANSWER_3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    TEST_ANSWER_4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    TEST_ANSWER_5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    TEST_ANSWER_6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    TEST_ANSWER_7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    TEST_ANSWER_8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class TestsData1:
    TEST_NAME = "Кристина"
    TEST_SURNAME = "Селезнёва"
    TEST_ADDRESS = "Володарского 17"
    TEST_UNDERGROUND = "Бульвар Рокоссовского"
    TEST_NUMBER = "+7849567454"
    TEST_DATE = "08.01.2024"
    TEST_COMMENT = "Я сам курьер, но мои самокаты кончились"


class TestsData2:
    TEST_NAME = "Кирилл"
    TEST_SURNAME = "Селезнёв"
    TEST_ADDRESS = "Володарского 38"
    TEST_UNDERGROUND = "Преображенская площадь"
    TEST_NUMBER = "+7848567454"
    TEST_DATE = "08.02.2024"
    TEST_COMMENT = "Доставить на мою яхту"
